app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."order" IS NULL
---
      redirect_to movies_path(:rating => session[:ratings], :order => session[:by]) and return
    end

    @movies = Movie.find(:all, :conditions => {:rating => @selected_ratings}, :order => @by)