app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @by=params[:by]
    @movies = Movie.order(params[:by]).all